Tekla Open API Reference for Tekla Structures 2025
Intersection.LineToPlane Method
 Returns a new point which is an intersection of the given line and plane or null if the line and the plane are parallel.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Point LineToPlane(
	Line line,
	GeometricPlane plane
)
Public Shared Function LineToPlane (
	line As Line,
	plane As GeometricPlane
) As Point
Parameters
line
Type: Tekla.Structures.Geometry3d.Line
The line to be used.
plane
Type: Tekla.Structures.Geometry3d.GeometricPlane
The plane to be used.
Return Value
Type: Point
The intersection point or null if no intersection was found.
See Also
Reference
Intersection Class
Tekla.Structures.Geometry3d Namespace